
//Создать класс «круг», а в нём статическую константу - число пи.
//Определить поля: радиус, площадь и длинна окружности. В конструкторе принимать радиус.
//Высчитать площадь и длину окружности.
package OOP.circle;

public class main {
    public static void main(String[] args) {
        Circle circle=new Circle(5);

        System.out.println(circle);

    }
}
