package OOP.discriminatori;

//Определить класс «квадратное уравнение» с полями а, б и с - коэффициентами уравнения.
//Написать метод, который возвращает дискриминант.
public class dz_discriminatory {
    public static void main(String[] args) {
        Discriminatory discriminatory=new Discriminatory();
        discriminatory.disc();
        System.out.println(discriminatory);
    }
}
